In [3]:
import pandas as pd

In [7]:
dataset1=pd.read_csv("C:\\Users\\azy51\\Downloads\\_iris.csv")
dataset1

     5.1  3.5  1.4  0.2     Iris-setosa
0    4.9  3.0  1.4  0.2     Iris-setosa
1    4.7  3.2  1.3  0.2     Iris-setosa
2    4.6  3.1  1.5  0.2     Iris-setosa
3    5.0  3.6  1.4  0.2     Iris-setosa
4    5.4  3.9  1.7  0.4     Iris-setosa
..   ...  ...  ...  ...             ...
144  6.7  3.0  5.2  2.3  Iris-virginica
145  6.3  2.5  5.0  1.9  Iris-virginica
146  6.5  3.0  5.2  2.0  Iris-virginica
147  6.2  3.4  5.4  2.3  Iris-virginica
148  5.9  3.0  5.1  1.8  Iris-virginica

[149 rows x 5 columns]

In [9]:
dataset1.head()

   5.1  3.5  1.4  0.2  Iris-setosa
0  4.9  3.0  1.4  0.2  Iris-setosa
1  4.7  3.2  1.3  0.2  Iris-setosa
2  4.6  3.1  1.5  0.2  Iris-setosa
3  5.0  3.6  1.4  0.2  Iris-setosa
4  5.4  3.9  1.7  0.4  Iris-setosa

In [11]:
dataset1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   5.1          149 non-null    float64
 1   3.5          149 non-null    float64
 2   1.4          149 non-null    float64
 3   0.2          149 non-null    float64
 4   Iris-setosa  149 non-null    object
dtypes: float64(4), object(1)
memory usage: 5.9+ KB

In [13]:
dataset1.describe()

              5.1         3.5         1.4         0.2
count  149.000000  149.000000  149.000000  149.000000
mean     5.848322    3.051007    3.774497    1.205369
std      0.828594    0.433499    1.759651    0.761292
min      4.300000    2.000000    1.000000    0.100000
25%      5.100000    2.800000    1.600000    0.300000
50%      5.800000    3.000000    4.400000    1.300000
75%      6.400000    3.300000    5.100000    1.800000
max      7.900000    4.400000    6.900000    2.500000

In [15]:
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 28]}

df = pd.DataFrame(data)

In [17]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   28

In [19]:
df["Age"]

0    25
1    30
2    28
Name: Age, dtype: int64

In [21]:
dataset1["3.5"]

0      3.0
1      3.2
2      3.1
3      3.6
4      3.9
      ...
144    3.0
145    2.5
146    3.0
147    3.4
148    3.0
Name: 3.5, Length: 149, dtype: float64

In [23]:
df.loc[0]

Name    Alice
Age        25
Name: 0, dtype: object

In [25]:
df[df["Age"]>25]

      Name  Age
1      Bob   30
2  Charlie   28

In [27]:
df["Age"].isnull()

0    False
1    False
2    False
Name: Age, dtype: bool

In [29]:
dataset1["3.5"].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
144    False
145    False
146    False
147    False
148    False
Name: 3.5, Length: 149, dtype: bool

In [39]:
dataset1_sorted=dataset1.sort_values(by="3.5",ascending=True)

In [43]:
dataset1_sorted

     5.1  3.5  1.4  0.2      Iris-setosa
59   5.0  2.0  3.5  1.0  Iris-versicolor
61   6.0  2.2  4.0  1.0  Iris-versicolor
118  6.0  2.2  5.0  1.5   Iris-virginica
67   6.2  2.2  4.5  1.5  Iris-versicolor
92   5.0  2.3  3.3  1.0  Iris-versicolor
..   ...  ...  ...  ...              ...
15   5.4  3.9  1.3  0.4      Iris-setosa
13   5.8  4.0  1.2  0.2      Iris-setosa
31   5.2  4.1  1.5  0.1      Iris-setosa
32   5.5  4.2  1.4  0.2      Iris-setosa
14   5.7  4.4  1.5  0.4      Iris-setosa

[149 rows x 5 columns]

In [45]:
dataset1_filter=dataset1[dataset1["3.5"]>2.5]

In [47]:
dataset1_filter

     5.1  3.5  1.4  0.2     Iris-setosa
0    4.9  3.0  1.4  0.2     Iris-setosa
1    4.7  3.2  1.3  0.2     Iris-setosa
2    4.6  3.1  1.5  0.2     Iris-setosa
3    5.0  3.6  1.4  0.2     Iris-setosa
4    5.4  3.9  1.7  0.4     Iris-setosa
..   ...  ...  ...  ...             ...
143  6.7  3.3  5.7  2.5  Iris-virginica
144  6.7  3.0  5.2  2.3  Iris-virginica
146  6.5  3.0  5.2  2.0  Iris-virginica
147  6.2  3.4  5.4  2.3  Iris-virginica
148  5.9  3.0  5.1  1.8  Iris-virginica

[130 rows x 5 columns]

In [51]:
import numpy as np

In [53]:
df_missing=pd.DataFrame({"A":[1,2,np.nan],"B":[3,4,np.nan],"C":[7,8,np.nan]})
df_missing

     A    B    C
0  1.0  3.0  7.0
1  2.0  4.0  8.0
2  NaN  NaN  NaN

In [55]:
df_filled=df_missing.fillna(1)
df_filled

     A    B    C
0  1.0  3.0  7.0
1  2.0  4.0  8.0
2  1.0  1.0  1.0

In [1]:
dataset2=pd.read_csv("C:\\Users\\azy51\\Downloads\\_iris.csv")

NameError: name 'pd' is not defined

In [3]:
import pandas as pd

In [5]:
dataset2=pd.read_csv("C:\\Users\\azy51\\Downloads\\_iris.csv")

In [7]:
dataset2.head()

   5.1  3.5  1.4  0.2  Iris-setosa
0  4.9  3.0  1.4  0.2  Iris-setosa
1  4.7  3.2  1.3  0.2  Iris-setosa
2  4.6  3.1  1.5  0.2  Iris-setosa
3  5.0  3.6  1.4  0.2  Iris-setosa
4  5.4  3.9  1.7  0.4  Iris-setosa

In [9]:
dataset2=pd.read_csv("C:\\Users\\azy51\\Downloads\\sales_data.csv")

In [13]:
dataset2.head()

,Product_ID,Sale_Date,Sales_Rep,Region,Sales_Amount,Quantity_Sold,Product_Category,Unit_Cost,Unit_Price,Customer_Type,Discount,Payment_Method,Sales_Channel,Region_and_Sales_Rep
0,1052,2023-02-03,Bob,North,5053.97,18,Furniture,152.75,267.22,Returning,0.09,Cash,Online,North-Bob
1,1093,2023-04-21,Bob,West,4384.02,17,Furniture,3816.39,4209.44,Returning,0.11,Cash,Retail,West-Bob
2,1015,2023-09-21,David,South,4631.23,30,Food,261.56,371.40,Returning,0.20,Bank Transfer,Retail,South-David
3,1072,2023-08-24,Bob,South,2167.94,39,Clothing,4330.03,4467.75,New,0.02,Credit Card,Retail,South-Bob
4,1061,2023-03-24,Charlie,East,3750.20,13,Electronics,637.37,692.71,New,0.08,Credit Card,Online,East-Charlie

In [15]:
dataset2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Product_ID            1000 non-null   int64
 1   Sale_Date             1000 non-null   object
 2   Sales_Rep             1000 non-null   object
 3   Region                1000 non-null   object
 4   Sales_Amount          1000 non-null   float64
 5   Quantity_Sold         1000 non-null   int64
 6   Product_Category      1000 non-null   object
 7   Unit_Cost             1000 non-null   float64
 8   Unit_Price            1000 non-null   float64
 9   Customer_Type         1000 non-null   object
 10  Discount              1000 non-null   float64
 11  Payment_Method        1000 non-null   object
 12  Sales_Channel         1000 non-null   object
 13  Region_and_Sales_Rep  1000 non-null   object
dtypes: float64(4), int64(2), object(8)
memory usage: 109.5+ KB

In [19]:
dataset2.isnull().sum()

Product_ID              0
Sale_Date               0
Sales_Rep               0
Region                  0
Sales_Amount            0
Quantity_Sold           0
Product_Category        0
Unit_Cost               0
Unit_Price              0
Customer_Type           0
Discount                0
Payment_Method          0
Sales_Channel           0
Region_and_Sales_Rep    0
dtype: int64

In [27]:
dataset2=dataset2.drop("Product_ID",axis=1)

In [29]:
dataset2.head()

,Sale_Date,Sales_Rep,Region,Sales_Amount,Quantity_Sold,Product_Category,Unit_Cost,Unit_Price,Customer_Type,Discount,Payment_Method,Sales_Channel,Region_and_Sales_Rep
0,2023-02-03,Bob,North,5053.97,18,Furniture,152.75,267.22,Returning,0.09,Cash,Online,North-Bob
1,2023-04-21,Bob,West,4384.02,17,Furniture,3816.39,4209.44,Returning,0.11,Cash,Retail,West-Bob
2,2023-09-21,David,South,4631.23,30,Food,261.56,371.40,Returning,0.20,Bank Transfer,Retail,South-David
3,2023-08-24,Bob,South,2167.94,39,Clothing,4330.03,4467.75,New,0.02,Credit Card,Retail,South-Bob
4,2023-03-24,Charlie,East,3750.20,13,Electronics,637.37,692.71,New,0.08,Credit Card,Online,East-Charlie

In [33]:
sales_by_product=dataset2.groupby("Product_Category")["Sales_Amount"].sum()

In [35]:
sales_by_product

Product_Category
Clothing       1313474.36
Electronics    1243499.64
Food           1201773.54
Furniture      1260517.69
Name: Sales_Amount, dtype: float64